# **Problem Statement:**
The Phonepe pulse Github repository contains a large amount of data related to
various metrics and statistics. The goal is to extract this data and process it to obtain
insights and information that can be visualized in a user-friendly manner.

In [31]:
#Once created the clone of GIT-HUB repository then,
#Required libraries for the program

import pandas as pd
import json
import os
import requests

In [32]:
import os

In [33]:
os.listdir(r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master")

['.gitignore', 'data', 'LICENSE', 'README.md']

In [34]:
import pprint

In [35]:
def scientific_to_amount(scientific_notation):
    # Convert scientific notation to a float
    number = float(scientific_notation)

    # Format the float as a string with two decimal places
    formatted_amount = '{:.2f}'.format(number)

    return formatted_amount

In [36]:
path=r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\aggregated\transaction\country\india\state"
Agg_state_list=os.listdir(path)
Agg_state_list
#Agg_state_list--> to get the list of states in India
#This is to extract the data's to create a dataframe

D1 = {'State': [], 'Year': [], 'Quarter': [], 'Transaction_type': [], 'Transaction_count': [], 'Transaction_amount': []}
for i in Agg_state_list:
    p = path + "/" + i
    Agg_yr = os.listdir(p)
    for y in Agg_yr:
        M = p + "/" + y
        Agg_yr_list = os.listdir(M)

        for k in Agg_yr_list:
            N = M + "/" + k
            Data = open(N, 'r')
            A = json.load(Data)
            for v in A['data']['transactionData']:
                Name = v["name"]
                count = v["paymentInstruments"][0]['count']
                amount = scientific_to_amount(v["paymentInstruments"][0]['amount'])
                D1["Transaction_type"].append(Name)
                D1["Transaction_count"].append(count)
                D1["Transaction_amount"].append(amount)
                D1["State"].append(i)
                D1["Year"].append(y)
                D1["Quarter"].append(int(k.strip('.json')))
Agg_Trans= pd.DataFrame(D1)
#Agg_Trans.to_csv('Agg_trans.csv')

In [37]:
Agg_Trans

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1845307.47
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,12138655.30
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,452507.17
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,10601.42
4,andaman-&-nicobar-islands,2018,1,Others,256,184689.87
...,...,...,...,...,...,...
4129,west-bengal,2023,3,Merchant payments,296965002,200440391406.00
4130,west-bengal,2023,3,Peer-to-peer payments,271150280,831050092805.00
4131,west-bengal,2023,3,Recharge & bill payments,63055684,39209851435.00
4132,west-bengal,2023,3,Financial Services,389751,424985591.00
4133,west-bengal,2023,3,Others,532474,423285145.00

In [38]:
pprint.pprint(path)

'C:\\Users\\g.rakesh\\Downloads\\pulse-master\\pulse-master\\data\\aggregated\\transaction\\country\\india\\state'

In [39]:
path = r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\aggregated\user\country\india\state"
D2 = {'State': [], 'Year': [], 'Quarter': [], 'Brand': [], 'count': [], 'Percentage': []}
Agg_state = os.listdir(path)
for i in Agg_state:
    p = path + "/" + i
    agg_yr = os.listdir(p)
    for y in agg_yr:
        p2 = p + "/" + y
        agg_yr_det = os.listdir(p2)
        for k in agg_yr_det:
            p3 = p2 + "/" + k
            data = open(p3, 'r')
            B = json.load(data)
            try:
                for v in B['data']['usersByDevice']:
                    D2["Brand"].append(v['brand'])
                    D2["count"].append(v['count'])
                    D2["Percentage"] = v['percentage']
                    D2["State"].append(i)
                    D2["Year"].append(y)
                    D2["Quarter"].append(int(k.strip('.json')))
            except:
                pass
Agg_user= pd.DataFrame(D2)
#Agg_user.to_csv("Agg_user.csv")

In [40]:
Agg_user

                          State  Year  Quarter    Brand    count  Percentage
0     andaman-&-nicobar-islands  2018        1   Xiaomi     1665    0.100199
1     andaman-&-nicobar-islands  2018        1  Samsung     1445    0.100199
2     andaman-&-nicobar-islands  2018        1     Vivo      982    0.100199
3     andaman-&-nicobar-islands  2018        1     Oppo      501    0.100199
4     andaman-&-nicobar-islands  2018        1  OnePlus      332    0.100199
...                         ...   ...      ...      ...      ...         ...
6727                west-bengal  2022        1   Lenovo   330017    0.100199
6728                west-bengal  2022        1  Infinix   284678    0.100199
6729                west-bengal  2022        1     Asus   280347    0.100199
6730                west-bengal  2022        1    Apple   277752    0.100199
6731                west-bengal  2022        1   Others  2196334    0.100199

[6732 rows x 6 columns]

In [41]:
path = r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\map\transaction\hover\country\india\state"
hover_state = os.listdir(path)
D3 = {'State': [], 'Year': [], 'Quarter': [], 'District': [], 'Count': [], 'Amount': []}
for i in hover_state:
    p = path + "/" + i
    hover_yr = os.listdir(p)
    for row in hover_yr:
        M = p + "/" + row
        hover_yr = os.listdir(M)
        for k in hover_yr:
            N = M + "/" + k
            Data = open(N, 'r')
            A = json.load(Data)
            for v in A['data']['hoverDataList']:
                Name = v["name"]
                count = v["metric"][0]['count']

                D3["District"].append(Name)
                D3["Count"].append(count)
                D3["Amount"].append(amount)
                D3["State"].append(i)
                D3["Year"].append(row)
                D3["Quarter"].append(int(k.strip('.json')))
map_trans = pd.DataFrame(D3)
#map_trans.to_csv("map_trans.csv")

In [42]:
map_trans

,State,Year,Quarter,District,Count,Amount
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,442,423285145.00
1,andaman-&-nicobar-islands,2018,1,south andaman district,5688,423285145.00
2,andaman-&-nicobar-islands,2018,1,nicobars district,528,423285145.00
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,825,423285145.00
4,andaman-&-nicobar-islands,2018,2,south andaman district,9395,423285145.00
...,...,...,...,...,...,...
16827,west-bengal,2023,3,nadia district,30146530,423285145.00
16828,west-bengal,2023,3,birbhum district,17597047,423285145.00
16829,west-bengal,2023,3,purba medinipur district,34244893,423285145.00
16830,west-bengal,2023,3,maldah district,28539407,423285145.00
16831,west-bengal,2023,3,darjiling district,14747572,423285145.00

In [43]:
path =r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\map\user\hover\country\india\state"
hover_state = os.listdir(path)
D4 = {'State': [], 'Year': [], 'Quarter' : [], 'Users' : [], 'Districts' : [], 'App_open': []}
for i in hover_state:
  p = path + "/" + i
  hover_yr = os.listdir(p)
  for row in hover_yr:
    M = p + "/" + row
    hover_yr = os.listdir(M)
    for K in hover_yr:
      N = M + "/"+ K
      Data = open(N, 'r')
      A =json.load(Data)
      for district ,values in A['data']['hoverData'].items():
        users = values['registeredUsers']
        AppOpens = values['appOpens']
        d = district
        D4["Users"].append(users)
        D4["App_open"].append(AppOpens)
        D4["Districts"].append(d)
        D4["State"].append(i)
        D4["Year"].append(row)
        D4["Quarter"].append(int(k.strip('.json')))
map_user = pd.DataFrame(D4)
#map_user.to_csv('map_user_state.csv')

In [44]:
map_user

,State,Year,Quarter,Users,Districts,App_open
0,andaman-&-nicobar-islands,2018,3,632,north and middle andaman district,0
1,andaman-&-nicobar-islands,2018,3,5846,south andaman district,0
2,andaman-&-nicobar-islands,2018,3,262,nicobars district,0
3,andaman-&-nicobar-islands,2018,3,911,north and middle andaman district,0
4,andaman-&-nicobar-islands,2018,3,8143,south andaman district,0
...,...,...,...,...,...,...
16831,west-bengal,2023,3,1544294,nadia district,12674328
16832,west-bengal,2023,3,974363,birbhum district,18961683
16833,west-bengal,2023,3,1530289,purba medinipur district,18593769
16834,west-bengal,2023,3,1091634,maldah district,28020285
16835,west-bengal,2023,3,637665,darjiling district,21732323

In [45]:
path = r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\top\transaction\country\india\state"
top_states = os.listdir(path)
D5 = {'State': [], 'Year': [], 'Quarter': [], 'Pincode': [], 'Transaction_Count': [], 'Transaction_Amount': []}
for i in top_states:
    p = path + "/" + i
    top_yr = os.listdir(p)
    for row in top_yr:
        M = p + "/" + row
        top_yr_list = os.listdir(M)
        for k in top_yr_list:
            N = M + '/' + k
            with open(N, 'r') as file:
                A = json.load(file)
            for z in A['data']['pincodes']:
                pincode = z['entityName']
                count = z['metric']['count']
                amount = scientific_to_amount(z['metric']['amount'])
                D5['Transaction_Count'].append(count)
                D5['Transaction_Amount'].append(amount)
                D5['Pincode'].append(pincode)
                D5['State'].append(i)
                D5['Year'].append(row)
                D5["Quarter"].append(int(k.strip('.json')))
# pprint.pprint(D5)
top_trans = pd.DataFrame(D5)
#top_trans.to_csv("top_trans.csv")
top_trans.head(20)

,State,Year,Quarter,Pincode,Transaction_Count,Transaction_Amount
0,andaman-&-nicobar-islands,2018,1,744101,1622,2769297.90
1,andaman-&-nicobar-islands,2018,1,744103,1223,2238041.87
2,andaman-&-nicobar-islands,2018,1,744102,969,3519059.94
3,andaman-&-nicobar-islands,2018,1,744105,685,1298560.95
4,andaman-&-nicobar-islands,2018,1,744104,340,1039715.31
5,andaman-&-nicobar-islands,2018,1,744107,302,556059.53
6,andaman-&-nicobar-islands,2018,1,744301,283,445739.16
7,andaman-&-nicobar-islands,2018,1,744112,269,333709.57
8,andaman-&-nicobar-islands,2018,1,744202,193,238914.02
9,andaman-&-nicobar-islands,2018,1,744302,168,547469.65
10,andaman-&-nicobar-islands,2018,2,744101,2701,6310089.92
11,andaman-&-nicobar-islands,2018,2,744103,1965,4752146.70
12,andaman-&-nicobar-islands,2018,2,744102,1525,5810267.57
13,andaman-&-nicobar-islands,2018,2,744105,997,2200332.97
14,andaman-&-nicobar-islands,2018,2,744301,767,1953749.38
15,andaman-&-nicobar-islands,2018,2,744104,659,1650346.19
16,andaman-&-nicobar-islands,2018,2,744107,594,1601569.98
17,andaman-&-nicobar-islands,2018,2,744112,432,578829.18
18,andaman-&-nicobar-islands,2018,2,744202,405,626523.98
19,andaman-&-nicobar-islands,2018,2,744302,291,1026590.07

In [46]:
path = r"C:\Users\g.rakesh\Downloads\pulse-master\pulse-master\data\top\user\country\india\state"
top_states = os.listdir(path)
D6 = {'State': [], 'Year': [], 'Quarter': [], 'Districts': [], 'Registered_user': []}
for i in top_states:
    p = path + "/" + i
    top_yr = os.listdir(p)
    for row in top_yr:
        M = p + "/" + row
        top_yr_list = os.listdir(M)
        for k in top_yr_list:
            N = M + '/' + k
            with open(N, 'r') as file:
                A = json.load(file)
            for z in A['data']['districts']:
                dname = z['name']
                reg_user = z['registeredUsers']
                D6['State'].append(i)
                D6['Year'].append(row)
                D6["Quarter"].append(int(k.strip('.json')))
                D6['Districts'].append(dname)
                D6['Registered_user'].append(reg_user)

top_user_state= pd.DataFrame(D6)
#top_user_state.to_csv("top_user_state.csv")
top_user_state

,State,Year,Quarter,Districts,Registered_user
0,andaman-&-nicobar-islands,2018,1,south andaman,5846
1,andaman-&-nicobar-islands,2018,1,north and middle andaman,632
2,andaman-&-nicobar-islands,2018,1,nicobars,262
3,andaman-&-nicobar-islands,2018,2,south andaman,8143
4,andaman-&-nicobar-islands,2018,2,north and middle andaman,911
...,...,...,...,...,...
6803,west-bengal,2023,3,howrah,1608895
6804,west-bengal,2023,3,nadia,1544294
6805,west-bengal,2023,3,purba medinipur,1530289
6806,west-bengal,2023,3,paschim medinipur,1384076
6807,west-bengal,2023,3,purba bardhaman,1272153

# Data Preprocessing
# Data Cleaning

   Data cleaning is the process of identifying and correcting or removing errors, inconsistencies, and inaccuracies in a dataset to improve its quality and ensure that it is ready for analysis. It involves tasks such as handling missing or duplicate data, correcting data types, and removing outliers or irrelevant information.

In [47]:
# looking for the amount of null data in the pandas dataframe
Agg_Trans.isnull().sum()

State                 0
Year                  0
Quarter               0
Transaction_type      0
Transaction_count     0
Transaction_amount    0
dtype: int64

In [48]:
# looking for the amount of null data in the pandas dataframe
Agg_user.isnull().sum()

State         0
Year          0
Quarter       0
Brand         0
count         0
Percentage    0
dtype: int64

In [49]:
# looking for the amount of null data in the pandas dataframe
map_trans.isnull().sum()

State       0
Year        0
Quarter     0
District    0
Count       0
Amount      0
dtype: int64

In [50]:
# looking for the amount of null data in the pandas dataframe
map_user.isnull().sum()

State        0
Year         0
Quarter      0
Users        0
Districts    0
App_open     0
dtype: int64

In [51]:
# looking for the amount of null data in the pandas dataframe
top_trans.isnull().sum()

State                 0
Year                  0
Quarter               0
Pincode               2
Transaction_Count     0
Transaction_Amount    0
dtype: int64

In [52]:
#remove the null values
top_trans = top_trans.dropna()

In [53]:
# after checking the null values
top_trans.isnull().sum()

State                 0
Year                  0
Quarter               0
Pincode               0
Transaction_Count     0
Transaction_Amount    0
dtype: int64

In [54]:
# looking for the amount of null data in the pandas dataframe
top_user_state.isnull().sum()

State              0
Year               0
Quarter            0
Districts          0
Registered_user    0
dtype: int64

### **No Null Values For All DataFrames**

connecting the database

In [55]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\g.rakesh\anaconda3\lib\site-packages (1.1.0)Note: you may need to restart the kernel to use updated packages.

In [56]:
import pymysql

In [57]:
# Establish the connection
con = pymysql.connect(host = 'localhost',
                        user = 'root',
                        password = "Rakesh123",
                        autocommit=True
                      )


mycursor = con.cursor()
mycursor.execute("CREATE DATABASE IF NOT EXISTS phonepe_db")
mycursor.execute("USE phonepe_db")

0

In [58]:
#create the database and insert the values agg_transaction
query = "create table agg_transaction(state varchar(100), year int, quarter int, trans_type varchar(80), trans_count int, trans_amt double)"
mycursor.execute(query)

0

In [59]:
for i, row in Agg_Trans.iterrows():
    query = "insert into agg_transaction values (%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))

In [60]:
#create the database and insert the values agg_user
query = "create table agg_user(state varchar(100),year int, quarter int, brand varchar(30), count int, percentage double)"
mycursor.execute(query)

0

In [61]:
for i, row in Agg_user.iterrows():
    query = "insert into agg_user values (%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))

In [62]:
#create the database and insert the values map_transaction
query = "create table map_trans(state varchar(100),year int, quarter int,district varchar(100), count int, amount double)"
mycursor.execute(query)

0

In [63]:
for i, row in map_trans.iterrows():
    query = "insert into map_trans values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))

In [64]:
#create the database and insert the values map_user
query = "create table map_user(state varchar(100),year int, quarter int, Reg_users int, district varchar(100), app_open int)"
mycursor.execute(query)

0

In [65]:
for i, row in map_user.iterrows():
    query = "insert into map_user values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))

In [66]:
#create the database and insert the values top_transaction
query = "create table top_trans(state varchar(100),year int, quarter int, pincode int, transaction_count int, transaction_amount double)"
mycursor.execute(query)

0

In [67]:
for i, row in top_trans.iterrows():
    query = "insert into top_trans values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))

In [68]:
#create the database and insert the values top_user
query = "create table top_user_state (state varchar(100),year int, quarter int, district varchar(80),Reg_users int)"
mycursor.execute(query)

0

In [69]:
for i, row in top_user_state.iterrows():
    query = "insert into top_user_state values(%s,%s,%s,%s,%s)"
    mycursor.execute(query, tuple(row))